zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/cc13x4_cc26x4-pinctrl.h
/*
 * Copyright (c) 2026 Texas Instruments
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef CC13X4_CC26X4_PINCTRL_H_
#define CC13X4_CC26X4_PINCTRL_H_

/* IOC Peripheral Port Mapping */
#define IOC_PORT_GPIO             0x00000000  /* Default general purpose IO */
#define IOC_PORT_AON_CLK32K       0x00000007  /* AON External 32kHz clock */
#define IOC_PORT_AUX_IO           0x00000008  /* AUX IO Pin */

/* SPI0 (renamed from SSI0; aliases kept for CC13x2 source compatibility) */
#define IOC_PORT_MCU_SPI0_RX      0x00000009
#define IOC_PORT_MCU_SPI0_TX      0x0000000A
#define IOC_PORT_MCU_SPI0_FSS     0x0000000B
#define IOC_PORT_MCU_SPI0_CLK     0x0000000C
#define IOC_PORT_MCU_SSI0_RX      IOC_PORT_MCU_SPI0_RX
#define IOC_PORT_MCU_SSI0_TX      IOC_PORT_MCU_SPI0_TX
#define IOC_PORT_MCU_SSI0_FSS     IOC_PORT_MCU_SPI0_FSS
#define IOC_PORT_MCU_SSI0_CLK     IOC_PORT_MCU_SPI0_CLK

#define IOC_PORT_MCU_I2C_MSSDA    0x0000000D
#define IOC_PORT_MCU_I2C_MSSCL    0x0000000E

#define IOC_PORT_MCU_UART0_RX     0x0000000F
#define IOC_PORT_MCU_UART0_TX     0x00000010
#define IOC_PORT_MCU_UART0_CTS    0x00000011
#define IOC_PORT_MCU_UART0_RTS    0x00000012

#define IOC_PORT_MCU_UART1_RX     0x00000013
#define IOC_PORT_MCU_UART1_TX     0x00000014
#define IOC_PORT_MCU_UART1_CTS    0x00000015
#define IOC_PORT_MCU_UART1_RTS    0x00000016

#define IOC_PORT_MCU_PORT_EVENT0  0x00000017
#define IOC_PORT_MCU_PORT_EVENT1  0x00000018
#define IOC_PORT_MCU_PORT_EVENT2  0x00000019
#define IOC_PORT_MCU_PORT_EVENT3  0x0000001A
#define IOC_PORT_MCU_PORT_EVENT4  0x0000001B
#define IOC_PORT_MCU_PORT_EVENT5  0x0000001C
#define IOC_PORT_MCU_PORT_EVENT6  0x0000001D
#define IOC_PORT_MCU_PORT_EVENT7  0x0000001E

#define IOC_PORT_MCU_SWV          0x00000020  /* Serial Wire Viewer */

/* SPI1 (renamed from SSI1; aliases kept for CC13x2 source compatibility) */
#define IOC_PORT_MCU_SPI1_RX      0x00000021
#define IOC_PORT_MCU_SPI1_TX      0x00000022
#define IOC_PORT_MCU_SPI1_FSS     0x00000023
#define IOC_PORT_MCU_SPI1_CLK     0x00000024
#define IOC_PORT_MCU_SSI1_RX      IOC_PORT_MCU_SPI1_RX
#define IOC_PORT_MCU_SSI1_TX      IOC_PORT_MCU_SPI1_TX
#define IOC_PORT_MCU_SSI1_FSS     IOC_PORT_MCU_SPI1_FSS
#define IOC_PORT_MCU_SSI1_CLK     IOC_PORT_MCU_SPI1_CLK

#define IOC_PORT_MCU_I2S_AD0      0x00000025
#define IOC_PORT_MCU_I2S_AD1      0x00000026
#define IOC_PORT_MCU_I2S_WCLK     0x00000027
#define IOC_PORT_MCU_I2S_BCLK     0x00000028
#define IOC_PORT_MCU_I2S_MCLK     0x00000029

#define IOC_PORT_RFC_TRC          0x0000002E
#define IOC_PORT_RFC_GPO0         0x0000002F
#define IOC_PORT_RFC_GPO1         0x00000030
#define IOC_PORT_RFC_GPO2         0x00000031
#define IOC_PORT_RFC_GPO3         0x00000032
#define IOC_PORT_RFC_GPI0         0x00000033
#define IOC_PORT_RFC_GPI1         0x00000034
#define IOC_PORT_RFC_SMI_DL_OUT   0x00000035
#define IOC_PORT_RFC_SMI_DL_IN    0x00000036
#define IOC_PORT_RFC_SMI_CL_OUT   0x00000037
#define IOC_PORT_RFC_SMI_CL_IN    0x00000038

/* CC13x4/CC26x4 additional peripherals (not present in CC13x2) */
#define IOC_PORT_MCU_SPI2_RX      0x00000039
#define IOC_PORT_MCU_SPI2_TX      0x0000003A
#define IOC_PORT_MCU_SPI2_FSS     0x0000003B
#define IOC_PORT_MCU_SPI2_CLK     0x0000003C

#define IOC_PORT_MCU_SPI3_RX      0x0000003D
#define IOC_PORT_MCU_SPI3_TX      0x0000003E
#define IOC_PORT_MCU_SPI3_FSS     0x0000003F
#define IOC_PORT_MCU_SPI3_CLK     0x00000040

#define IOC_PORT_MCU_UART2_RX     0x00000041
#define IOC_PORT_MCU_UART2_TX     0x00000042
#define IOC_PORT_MCU_UART2_CTS    0x00000043
#define IOC_PORT_MCU_UART2_RTS    0x00000044

#define IOC_PORT_MCU_UART3_RX     0x00000045
#define IOC_PORT_MCU_UART3_TX     0x00000046
#define IOC_PORT_MCU_UART3_CTS    0x00000047
#define IOC_PORT_MCU_UART3_RTS    0x00000048

#define IOC_PORT_MCU_I2C1_MSSDA   0x00000049
#define IOC_PORT_MCU_I2C1_MSSCL   0x0000004A

/* Edge Detection (same values as CC13x2) */
#define IOC_NO_EDGE               0x00000000
#define IOC_FALLING_EDGE          0x00010000
#define IOC_RISING_EDGE           0x00020000
#define IOC_BOTH_EDGES            0x00030000

#endif /* CC13X4_CC26X4_PINCTRL_H_ */